
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |          13 |          0 |
## Affected resources by action

|  Action  | Resources                                                           |
|:--------:|:--------------------------------------------------------------------|
|    🟡    | `aws_glacier_vault.synology`                                        |
|    🟡    | `aws_iam_policy.synology`                                           |
|    🟡    | `aws_iam_user.synology`                                             |
|    🟡    | `module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost`       |
|    🟡    | `module.cost-alert.aws_sns_topic.cost_notifications`                |
|    🟡    | `module.github_connector.aws_iam_openid_connect_provider.github`    |
|    🟡    | `module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github` |
|    🟡    | `module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin`    |
|    🟡    | `module.ih-tf-aws-control-990466748045-admin.aws_iam_role.github`   |
|    🟡    | `module.mediapc.aws_iam_policy.backuper`                            |
|    🟡    | `module.mediapc.aws_iam_user.backuper`                              |
|    🟡    | `module.mediapc.module.dst.aws_s3_bucket.this`                      |
|    🟡    | `module.mediapc.module.dst.aws_s3_bucket_policy.this`               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_glacier_vault.synology will be updated in-place
  ~ resource "aws_glacier_vault" "synology" {
        id            = "synology"
        name          = "synology"
      ~ tags          = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all      = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.synology will be updated in-place
  ~ resource "aws_iam_policy" "synology" {
        id               = "arn:aws:iam::990466748045:policy/synology-glacier-backup"
        name             = "synology-glacier-backup"
      ~ tags             = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all         = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_user.synology will be updated in-place
  ~ resource "aws_iam_user" "synology" {
        id                   = "synology"
        name                 = "synology"
      ~ tags                 = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all             = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "periodic_cost" {
        id                                    = "[infrahouse]: AWS daily cost"
      ~ tags                                  = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all                              = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cost-alert.aws_sns_topic.cost_notifications will be updated in-place
  ~ resource "aws_sns_topic" "cost_notifications" {
        id                                       = "arn:aws:sns:us-east-1:990466748045:cost-periodic-20241029191106708600000002"
        name                                     = "cost-periodic-20241029191106708600000002"
      ~ tags                                     = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all                                 = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (29 unchanged attributes hidden)
    }

  # module.github_connector.aws_iam_openid_connect_provider.github will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
          - "created_by"        = "infrahouse/aws-control-990466748045" -> null
            "created_by_module" = "infrahouse/gh-identity-provider/aws"
            "module_version"    = "1.1.1"
        }
      ~ tags_all        = {
          ~ "created_by"        = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment"       = "production"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin-assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "000"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::990466748045:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_16bdbe5eb442e7ef",
                  + "arn:aws:iam::990466748045:role/ih-tf-aws-control-github",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github will be updated in-place
  ~ resource "aws_iam_policy" "github" {
        id               = "arn:aws:iam::990466748045:policy/ih-tf-aws-control-github"
        name             = "ih-tf-aws-control-github"
      ~ tags             = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all         = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin will be updated in-place
  ~ resource "aws_iam_role" "admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::990466748045:role/ih-tf-aws-control-github",
                              - "arn:aws:iam::990466748045:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_16bdbe5eb442e7ef",
                            ]
                        }
                      - Sid       = "000"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ih-tf-aws-control-admin"
        name                  = "ih-tf-aws-control-admin"
      ~ tags                  = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all              = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (10 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-990466748045-admin.aws_iam_role.github will be updated in-place
  ~ resource "aws_iam_role" "github" {
        id                    = "ih-tf-aws-control-github"
        name                  = "ih-tf-aws-control-github"
      ~ tags                  = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all              = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mediapc.aws_iam_policy.backuper will be updated in-place
  ~ resource "aws_iam_policy" "backuper" {
        id               = "arn:aws:iam::990466748045:policy/terraform-20230824154453948900000002"
        name             = "terraform-20230824154453948900000002"
      ~ tags             = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all         = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (7 unchanged attributes hidden)
    }

  # module.mediapc.aws_iam_user.backuper will be updated in-place
  ~ resource "aws_iam_user" "backuper" {
        id                   = "twindb20230824154451928300000001"
        name                 = "twindb20230824154451928300000001"
      ~ tags                 = {
          - "created_by" = "infrahouse/aws-control-990466748045" -> null
        }
      ~ tags_all             = {
          ~ "created_by"  = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment" = "production"
        }
        # (5 unchanged attributes hidden)
    }

  # module.mediapc.module.dst.data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + null,
          + (known after apply),
        ]
    }

  # module.mediapc.module.dst.data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::twindb20230824154451928300000001",
              + "arn:aws:s3:::twindb20230824154451928300000001/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.mediapc.module.dst.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "twindb20230824154451928300000001"
      ~ tags                        = {
          - "created_by"        = "infrahouse/aws-control-990466748045" -> null
            "created_by_module" = "infrahouse/s3-bucket/aws"
            "module_version"    = "0.3.1"
        }
      ~ tags_all                    = {
          ~ "created_by"        = "infrahouse/aws-control-990466748045" -> "infrahouse/aws-control"
          + "environment"       = "production"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.mediapc.module.dst.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "twindb20230824154451928300000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::twindb20230824154451928300000001/*",
                          - "arn:aws:s3:::twindb20230824154451928300000001",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 13 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAxMywgImRlc3Ryb3kiOiAwfX0=
```
</details>